rainer20512/stm32-fw/stm32h7/common_h7/Src/system/clockconfig.c
/**
  ******************************************************************************
  * @file    clockconfig.c
  * @author  Rainer
  * @brief   Several Clock Configurations with different sources, SYSCLK 
  *          frequencies and correct Vcore settings and NVM Wait states
  *
  *          Available configurations
  *          1a. HSI-Clock based with parameterized clk value of 8,16,32,64 MHz
  *              and 24 MHz,                Vcore Range 2, 0-3 WS
  *          1b. MSI-Clock based with parameterized clk value between 100kHz
  *              and 48 MHz,                Vcore Range 1, 0-2 WS
  *          2.  HSE Bypass mode, 8MHz,     Range 2, 0 WS
  *              ( this is specially for Nucleo-Boards ) 
  *          3a. HSI based, 16MHz,          Range 2, 1 WS
  *          3b. HSI based, 16MHz,          Range 1, 0 WS
  *          4.  PLL/HSI based, 32-80 MHz,  Range 1, 1-4 WS
  *         
  * @note    In every configuration there are only identical clock values for
  *          all types of sore clocks ( SYSCLK, HCLK, APB1 and APB2 CLK ) 
  *
  ******************************************************************************
  * Coarse Performance estimation
  * MSI  2MHZ Clocks, Scale 3, 0WS :  63700 Increments per second
  * MSI  4MHZ Clocks, Scale 3, 0WS : 129200 Increments per second
  * HSE  8MHZ Clocks, Scale 2, 0WS : 248100 Increments per second
  * HSI 16MHZ Clocks, Scale 2, 1WS : 430300 Increments per second
  * HSI 16MHZ Clocks, Scale 1, 0WS : 498000 Increments per second
  * PLL 32MHZ Clocks, Scale 1, 0WS : 862200 Increments per second
  ******************************************************************************
  */


/** @addtogroup CLOCK_CONFIG
  * @{
  */
#include "config/config.h"

#include "hardware.h"
#include "dev/devices.h"
#include "eeprom.h"
#include "system/pll.h"
#include "config/pll_config.h"
#include "system/clockconfig.h"
#include "system/timer_handler.h"


#include "debug_helper.h"

#if DEBUG_PROFILING > 0
    #include "system/profiling.h"
#endif

/******************************************************************************
 * Set all peripheral clocks to their maximum values with respect to current
 * sysclk rate 
 * @return the selected AHB clock frequency
 *****************************************************************************/
#if   defined(STM32H747xx) || defined(STM32H745xx) || defined(STM32H742xx) || defined(STM32H743xx)
    /* Max values for CPU clock, AXI & AHB Clock, APB Clock are :480Mhz, 240MHz, 120 MHz,  */
    /* Values must be specified in kHz */
    #define MAX_CLK_CPU     480000
    #define MAX_CLK_AHB     240000
    #define MAX_CLK_APB     120000
#elif defined(STM32H723xx) || defined(STM32H733xx) || defined(STM32H725xx) || defined(STM32H735xx) || defined(STM32H730xx)
    /* Max values for CPU clock, AXI & AHB Clock, APB Clock are :550Mhz, 275MHz, 137.5 MHz,  */
    /* Values must be specified in kHz */
    #define MAX_CLK_CPU     550000
    #define MAX_CLK_AHB     275000
    #define MAX_CLK_APB     137500
#else
    #error "No Clock limits defined for this MCU"
#endif


/*
 *************************************************************************************
 * All the stuff for clock change notification callback management
 * ( aside of callbacks in devices ) 
 **** C0001 ****
 ************************************************************************************/
#define MAX_CLKCHG_CB                4

static ClockChangeCB clkCB[MAX_CLKCHG_CB];/* Array of registered clk chng callbacks */
static int32_t numClkchangeCB = 0;      /* Number of "    "    "      "      "      */
static void ClockNotifyCallbacks(uint32_t);  /* forward declaration                 */


/*
 *************************************************************************************
 * As in Stop2 mode the wakeup clock is either MSI or HSI, we have to safe 
 * all neccessary parameters to be able to restore the clock settings when
 * normal clock source is not HSI16 or MSI.
 * When normal clock source is HSI16 or MSI, the same clock is selected as wakeup
 * clock source and we can continue as before sleep without any reconfiguration
 * All the following variables are set in "System_Clock_Set"
 *************************************************************************************/

static uint32_t saved_khz;                 /* The last selected PLL frequency        */
static uint32_t saved_latency;             /* last flash latency used w PLL clk src  */
static uint32_t saved_vosrange;            /* last VOS range used w PLL clk src      */
static bool saved_bSwitchOffMSI;           /* the last selected bSwitchOffMSI value  */
static void (*RestoreFn)( uint32_t, bool); /* the restore function to call           */
static bool bClockSettingVolatile;         /* true, if the clock settings will be    */
                                           /* lost in Stop mode                      */


/******************************************************************************
 * returns true, iff the clock configuration is volatile in STOP mode
 *****************************************************************************/
bool ClockMustReconfiguredAfterStop ( void )
{
    return bClockSettingVolatile;
}

/******************************************************************************
 * Call this function to reconfigure clock after STOP mode
 *****************************************************************************/
void ClockReconfigureAfterStop(void)
{
    /* Make sure, clock setting is volatile and restoreFn is set */
    assert(bClockSettingVolatile);
    assert(RestoreFn);
    RestoreFn( saved_khz, saved_bSwitchOffMSI );
}


#if   defined(STM32H747xx) || defined(STM32H745xx) || defined(STM32H742xx) || defined(STM32H743xx)
    /*
     *******************************************************************************
     * Flash wait states in dependency of Vcore and HCLK
     * see STM32H742/743 RefMan pg 159 / Table 17
     * @note flash_khz is the AXI clock, which is limited to 240MHz
     *******************************************************************************
     */
    static uint32_t GetFlashLatency( uint32_t vrange, uint32_t flash_khz )
    {  
        uint32_t flash_latency;

        if ( vrange > 0 && flash_khz > 240000 ) {
            Error_Handler_XX(-2, __FILE__, __LINE__); 
            flash_latency = FLASH_LATENCY_4;
        } else {
            switch ( vrange ) {
            case PWR_REGULATOR_VOLTAGE_SCALE0:
            case PWR_REGULATOR_VOLTAGE_SCALE1:
                  if      ( flash_khz > 225000 ) flash_latency = FLASH_LATENCY_4;
                  else if ( flash_khz > 210000 ) flash_latency = FLASH_LATENCY_3;
                  else if ( flash_khz > 140000 ) flash_latency = FLASH_LATENCY_2;
                  else if ( flash_khz > 70000  ) flash_latency = FLASH_LATENCY_1;
                  else                     flash_latency = FLASH_LATENCY_0;
                break;
            case PWR_REGULATOR_VOLTAGE_SCALE2:
                  if      ( flash_khz > 165000 ) flash_latency = FLASH_LATENCY_3;
                  else if ( flash_khz > 110000 ) flash_latency = FLASH_LATENCY_2;
                  else if ( flash_khz > 55000  ) flash_latency = FLASH_LATENCY_1;
                  else                     flash_latency = FLASH_LATENCY_0;
                break;
            case PWR_REGULATOR_VOLTAGE_SCALE3:
                  if      ( flash_khz > 180000 ) flash_latency = FLASH_LATENCY_4;
                  else if ( flash_khz > 135000 ) flash_latency = FLASH_LATENCY_3;
                  else if ( flash_khz > 90000  ) flash_latency = FLASH_LATENCY_2;
                  else if ( flash_khz > 45000  ) flash_latency = FLASH_LATENCY_1;
                  else                     flash_latency = FLASH_LATENCY_0;
                break;
             default:
                Error_Handler_XX(-2, __FILE__, __LINE__); 
                flash_latency = FLASH_LATENCY_4;
            }
        }
        return flash_latency;
    }

