rainer20512/stm32-fw/stm32h7/common_h7/Src/system/clockconfig.c
    /*
     *******************************************************************************
     * Flash programming delay depends only from AXI/AHB frequency
     * @note flash_khz is the AXI clock, which is limited to 240MHz
     *******************************************************************************
     */
    static uint32_t GetFlashPrgDelay(uint32_t flash_khz)
    {
        return flash_khz > 185000 ? FLASH_PROGRAMMING_DELAY_2 : flash_khz > 70000 ? FLASH_PROGRAMMING_DELAY_1 : FLASH_PROGRAMMING_DELAY_0 ;
    }

#elif defined(STM32H723xx) || defined(STM32H733xx) || defined(STM32H725xx) || defined(STM32H735xx) || defined(STM32H730xx)
    /*
     *******************************************************************************
     * Flash wait states in dependency of Vcore and HCLK
     * see STM32H723/725/733/735/730 RefMan pg 161 / Table 16
     * @note flash_khz is the AXI clock, which is limited to 275MHz
     *******************************************************************************
     */
    static uint32_t GetFlashLatency( uint32_t vrange, uint32_t flash_khz )
    {  
        uint32_t flash_latency;

        /* 
         * Every Vrange has its own max AXI Clock, 
         * when maximum is exceeded, set flash latency to 7 and flag an error
         */
        switch ( vrange ) {
        case PWR_REGULATOR_VOLTAGE_SCALE0:
              if      ( flash_khz > 275000 ) flash_latency = FLASH_LATENCY_7;
              else if ( flash_khz > 210000 ) flash_latency = FLASH_LATENCY_3;
              else if ( flash_khz > 140000 ) flash_latency = FLASH_LATENCY_2;
              else if ( flash_khz > 70000  ) flash_latency = FLASH_LATENCY_1;
              else                     flash_latency = FLASH_LATENCY_0;
            break;
        case PWR_REGULATOR_VOLTAGE_SCALE1:
              if      ( flash_khz > 200000 ) flash_latency = FLASH_LATENCY_7;
              else if ( flash_khz > 133000 ) flash_latency = FLASH_LATENCY_2;
              else if ( flash_khz > 67000  ) flash_latency = FLASH_LATENCY_1;
              else                     flash_latency = FLASH_LATENCY_0;
            break;
        case PWR_REGULATOR_VOLTAGE_SCALE2:
              if      ( flash_khz > 150000 ) flash_latency = FLASH_LATENCY_7;
              else if ( flash_khz > 100000 ) flash_latency = FLASH_LATENCY_2;
              else if ( flash_khz > 50000  ) flash_latency = FLASH_LATENCY_1;
              else                     flash_latency = FLASH_LATENCY_0;
            break;
        case PWR_REGULATOR_VOLTAGE_SCALE3:
              if      ( flash_khz > 85000 )  flash_latency = FLASH_LATENCY_7;
              else if ( flash_khz > 70000 )  flash_latency = FLASH_LATENCY_2;
              else if ( flash_khz > 35000  ) flash_latency = FLASH_LATENCY_1;
              else                     flash_latency = FLASH_LATENCY_0;
            break;
         default:
            flash_latency = FLASH_LATENCY_7;
        }

        if ( flash_latency == FLASH_LATENCY_7 )
            Error_Handler_XX(-2, __FILE__, __LINE__); 
        
        return flash_latency;
    }
    /*
     *******************************************************************************
     * Flash programming delay depends only from AXI/AHB frequency
     * see STM32H7 RefMan pg 166 / Table 16
     * @note flash_khz is the AXI clock, which is limited to 240MHz
     *******************************************************************************
     */
    static uint32_t GetFlashPrgDelay(uint32_t flash_khz)
    {
        return flash_khz > 210000 ? FLASH_PROGRAMMING_DELAY_3 : flash_khz > 140000 ? FLASH_PROGRAMMING_DELAY_2 : flash_khz > 70000 ? FLASH_PROGRAMMING_DELAY_1 : FLASH_PROGRAMMING_DELAY_0 ;
    }
#else
    #error "No Flash Latency/Programming delay defined for this MCU"
#endif




static uint32_t SetPredividers( RCC_ClkInitTypeDef *ClkInit, uint32_t sysclk_khz )
{
    /* First check the maximum cpu clock limit */
    if ( sysclk_khz > MAX_CLK_CPU ) {
        Error_Handler_XX(-3, __FILE__, __LINE__); 
    }  

    /* Set all types of peripheral clocks */
    ClkInit->ClockType = ( RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_D1PCLK1 | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2  | RCC_CLOCKTYPE_D3PCLK1);
    
    /* D1CPrescaler is always 1 */
    ClkInit->SYSCLKDivider = RCC_SYSCLK_DIV1;

    /* 
     * We will always operate with the maximum possible AHB/AXI clock:
     * If sysclk is greater than maximum allowed AHB/AXI clock, set predivider to 2, otherwise to 1  
     */
    if ( sysclk_khz > MAX_CLK_AHB ) {
        ClkInit->AHBCLKDivider = RCC_HCLK_DIV2;
        sysclk_khz /= 2;
    } else {
        ClkInit->AHBCLKDivider = RCC_HCLK_DIV1;
    }   

    /* 
     * sysclk_khz is now the AHB clock frequency and AHB clk <= MAX_CLK_AHB at this point 
     * same strategy as before: Use the maximum possible APB clock frequency for all APB buses
     */
    if ( sysclk_khz > MAX_CLK_APB ) {
        ClkInit->APB3CLKDivider = RCC_APB3_DIV2;
        ClkInit->APB1CLKDivider = RCC_APB1_DIV2;
        ClkInit->APB2CLKDivider = RCC_APB2_DIV2;
        ClkInit->APB4CLKDivider = RCC_APB4_DIV2;
   } else {
        ClkInit->APB3CLKDivider = RCC_APB3_DIV1;
        ClkInit->APB1CLKDivider = RCC_APB1_DIV1;
        ClkInit->APB2CLKDivider = RCC_APB2_DIV1;
        ClkInit->APB4CLKDivider = RCC_APB4_DIV1;
   }

   /* return AHB clock frquency */
   return sysclk_khz;
}


/**********************************************************************************
 * Setup the selected SYSCLK provider, which is one OF HSI, HSE or PLL
 * HSI and HSE are handled by HAL Layer, PLL is handeled by hancrafted code
 *
 * In case of PLL, the PLL Clock provider, which can be HSI or HSE has to be
 * started by HAL _before_ PLL is activated
 * @returns != 0 on success
 **********************************************************************************/
static uint32_t SetupSysClkProvider ( RCC_OscInitTypeDef *o, RCC_ClkInitTypeDef *clk )
{
    bool success;
    /* 
     * Configure SYSCLK provider first. That can be HSI, HSE or PLL
     * If SYSCLK Is provided by PLL, the start is no longer done by
     * HAL Layer, but by handcrafted code in pll.c
     */
    /* Set PLL state to none to prevent HAL from configuring/starting PLL again */
    
    success = HAL_RCC_OscConfig(o) == HAL_OK;
    
    /* now handle the setup of the PLL and start it */
    if ( success && clk->SYSCLKSource == RCC_SYSCLKSOURCE_PLLCLK ) { 
      o->PLL.PLLState = RCC_PLL_ON;
      success = PLL_Set( &o->PLL, SYSCLK_PLL) == PLL_CONFIG_OK;
      #if USE_SDMMC > 0
        PLL_Configure_Line ( SYSCLK_PLL, PLL_LINE_Q, 200000 );
      #endif

      if ( success ) success = PLL_Start(SYSCLK_PLL) == PLL_CONFIG_OK;
    }
    
    return success;
}

/**********************************************************************************
 * Do a clock frequency transition. Depending from rising or lowering the clock frq,
 * the steps hasve to be done in different order
 * - Switching On the desired oscillator/PLL is done first
 * - when rising the clock frequency
 *    1. Increase Vcore if neccessary
 *    2. Change Clock, Prescalers and flash waitstates ( consistency is guaranteed by HAL )
 * - when decreasing
 *    1. Change Clock, Prescalers and flash waitstates ( consistency is guaranteed by HAL )
 *    2. Decrease Vcore
 **********************************************************************************/
static void   DoClockTransition ( uint32_t new_khz, RCC_OscInitTypeDef *o, RCC_ClkInitTypeDef *clk, uint32_t flash_latency, uint32_t prg_delay, uint32_t reg_scale, int32_t err_code)
{
    uint32_t old_khz = HAL_RCC_GetSysClockFreq()/1000;

    int32_t from, to, step;

    /* Configure new SYSCLK provider first. */
    if (!SetupSysClkProvider(o, clk)) Error_Handler_XX(err_code, __FILE__, __LINE__); 
  
