rainer20512/stm32-fw/stm32h7/common_h7/Src/system/clockconfig.c
    /* Then do the transition */
    if ( old_khz < new_khz ) {
        from = 1; to = 3; step = 1;
    } else {
        from = 2; to = 0; step = -1;
    }
    
    for ( int32_t i = from; i != to; i = i+step ) {
        switch ( i ) {
           case 1:
              /* Adjust Vcore */
              __HAL_PWR_VOLTAGESCALING_CONFIG(reg_scale);
              while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY));
              break;
           case 2:
              /* Set flash latency and programming delay */
              if (HAL_RCC_ClockConfig(clk, flash_latency)!= HAL_OK) Error_Handler_XX(err_code, __FILE__, __LINE__); 
              __HAL_FLASH_SET_PROGRAM_DELAY(prg_delay);
              break;
        }
    }

  /*activate CSI clock mandatory for I/O Compensation Cell*/
  __HAL_RCC_CSI_ENABLE() ;

  step = __HAL_RCC_SYSCFG_IS_CLK_DISABLED();
  /* Enable SYSCFG clock temporarily for I/O Compensation Cell */
  __HAL_RCC_SYSCFG_CLK_ENABLE() ;

  /* Enables the I/O Compensation Cell */
  HAL_EnableCompensationCell();

  /* Switch of SYSCFG clock agian, if it was off before */
  if ( step )   __HAL_RCC_SYSCFG_CLK_DISABLE() ;

}

#if defined(HW_HAS_HSE)
    /******************************************************************************
     * Configure HSE clock on
     * Be sure RCC_OscInitStruct has been zeroed before call
     *****************************************************************************/
    static void ConfigureHSE(RCC_OscInitTypeDef *RCC_OscInitStruct)
    {
      /* Enable HSE Oscillator */
      RCC_OscInitStruct->OscillatorType = RCC_OSCILLATORTYPE_HSE;
      #if defined(HW_HAS_HSE_CRYSTAL)
        RCC_OscInitStruct->HSEState = RCC_HSE_ON;
      #elif defined(HW_HAS_HSE_BYPASS)
        RCC_OscInitStruct->HSEState = RCC_HSE_BYPASS;
      #else
        #error "Undefined HSE oscillator type"
      #endif
      RCC_OscInitStruct->PLL.PLLState = RCC_PLL_NONE;
    }
#endif

/******************************************************************************
 * Configure HSI clock
 * Be sure RCC_OscInitStruct has been zeroed before call
 *****************************************************************************/
static void ConfigureHSI(RCC_OscInitTypeDef *RCC_OscInitStruct, uint32_t hsi_khz)
{
    RCC_OscInitStruct->OscillatorType = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct->PLL.PLLState = RCC_PLL_NONE;

    RCC_OscInitStruct->HSICalibrationValue=RCC_HSICALIBRATION_DEFAULT;  

    switch ( hsi_khz ) {
    case 8000: 
        RCC_OscInitStruct->HSIState = RCC_HSI_DIV8;
        break;
    case 16000: 
        RCC_OscInitStruct->HSIState = RCC_HSI_DIV4;
        break;
    case 32000: 
        RCC_OscInitStruct->HSIState = RCC_HSI_DIV2;
        break;
    case 64000: 
        RCC_OscInitStruct->HSIState = RCC_HSI_DIV1;
        break;
    default:
        Error_Handler_XX(-9, __FILE__, __LINE__); 
        return; 
    }
}

/******************************************************************************
 * Switch HSI clock off
 *****************************************************************************/
static void SwitchOffHSI(RCC_OscInitTypeDef *osc)
{
    memset(osc, 0, sizeof(RCC_OscInitTypeDef));
    
    osc->OscillatorType = RCC_OSCILLATORTYPE_HSI;
    osc->HSIState = RCC_HSI_OFF;
    if (HAL_RCC_OscConfig(osc)!= HAL_OK)
    {
        Error_Handler_XX(-6, __FILE__, __LINE__ );
    }
}

/******************************************************************************
 * Switch PLL  off
 *****************************************************************************/
static void SwitchOffSysClkPll(void)
{
    if (PLL_Stop(SYSCLK_PLL) != PLL_CONFIG_OK ) {
        Error_Handler_XX(-4, __FILE__, __LINE__ );
    }
}


/* Public functions ---------------------------------------------------------*/

/**
  * @brief  System Clock Configuration on MSI-Base
  *         The system Clock is configured as follow : 
  *            System Clock source            = HSI
  *            SYSCLK(Hz)                     = 8, 16, 32 or 64 MHz
  *            HCLK(Hz)                       = 8, 16, 32 or 64 MHz
  *            AHB Prescaler                  = 1
  *            APBx Prescaler                 = 1
  *            Flash Latency(WS)              = depending from SYSCLK
  *            Main regulator output voltage  = Range 3
  * @param hsi_khz -  one of 8000,16000,32000,640000 
  * @retval None
  */
static void SystemClock_HSI_VOSrange_3(uint32_t hsi_khz)
{
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};

    /* 
    * if HSI is current CLK source, it has to be deactivated before changes may be applied
    * so switch to HSE temporarily. This can be done without changing VOS range
    * or flash latency, because max HSE frq will meet the VOS and latency settings of current HSI
    */
    if ( __HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_HSI ) {
      ConfigureHSE(&RCC_OscInitStruct);
      if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
          Error_Handler_XX(-5, __FILE__, __LINE__); 
     RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK;
     RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
     RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
     if ( HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK )
          Error_Handler_XX(-5, __FILE__, __LINE__); 
      memset(&RCC_OscInitStruct,0, sizeof(RCC_OscInitTypeDef));
      memset(&RCC_ClkInitStruct,0, sizeof(RCC_ClkInitTypeDef));
    }
    /* 
     * At this "low" frequencies AHB clock frq = sysclk, so we can safely use sysclk 
     * as flash clock parameter for GetFlashLatency()
     */
    uint32_t flash_latency= GetFlashLatency(PWR_REGULATOR_VOLTAGE_SCALE3, hsi_khz);
    uint32_t prg_delay    = GetFlashPrgDelay(hsi_khz);

    /* configure HSI Oscillator */
    ConfigureHSI(& RCC_OscInitStruct, hsi_khz);

    SetPredividers( &RCC_ClkInitStruct, hsi_khz );
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;

    DoClockTransition ( hsi_khz, &RCC_OscInitStruct, &RCC_ClkInitStruct, flash_latency, prg_delay, PWR_REGULATOR_VOLTAGE_SCALE3, -6);
  
    /* Switch off PLL in any case */
    SwitchOffSysClkPll();

   /* Select HSI as WakeUp clock */
    CLEAR_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
}




/* HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- 
 * The following #ifdef-block requires an HSE oscillator being functional, either
 * as original crystal oscillator or being supplied as external clock
 * HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- HSE --*/

#if defined(HW_HAS_HSE)
    /**************************************************************************
     * The initialization part that has to be restored after wakeup from stop 
     * only available, if an HSE oscillator is euqipped
     *************************************************************************/
    static void SystemClock_HSE_xxMHz_Vrange_Auto_restore ( uint32_t xxmhz, bool bSwitchOffHSI)
    {
      UNUSED(xxmhz);
      RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
      RCC_OscInitTypeDef RCC_OscInitStruct = {0};

      /* Restart HSE after Stop */
      RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
      RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
      #if defined(HW_HAS_HSE_CRYSTAL)
        RCC_OscInitStruct.HSEState = RCC_HSE_ON;
      #else 
        /* Bypass */
        RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
      #endif
      if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
         Error_Handler_XX(-12, __FILE__, __LINE__); 

