rainer20512/stm32-fw/stm32h7/common_h7/Src/system/clockconfig.c
      RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK;
      RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
      RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
      if ( HAL_RCC_ClockConfig(&RCC_ClkInitStruct, saved_latency ) != HAL_OK )
         Error_Handler_XX(-12, __FILE__, __LINE__); 

      if ( bSwitchOffHSI ) {
        SwitchOffHSI(&RCC_OscInitStruct);
      }
    }

    /**************************************************************************
     * @brief  System Clock Configuration on 8MHz Clock input
     *         The system Clock is configured as follow : 
     *            System Clock source            = xx MHz Signal HSE Bypass mode or oscillator mode, depending from crystal
     *                                              allowed range for LSE is 4 .. 45 MHz
     *            SYSCLK(Hz)                     = xxMHz
     *            HCLK(Hz)                       = xxMhZ
     *            AHB Prescaler                  = 1
     *            APB1 Prescaler                 = 1
     *            APB2 Prescaler                 = 1
     *            Flash Latency(WS)              = 1
     *            Main regulator output voltage  = VOS range 3
     * @param  bSwitchOffHSI - Set to TRUE, if MSI Clock should be switched off. When going to sleep, MSI clock
     *         MUST be activated again, BEFORE going to sleep
     * @note the WakeUp Clock will be HSI, so user has to take actions to switch off to LSE after wakeup
     * @note only available, if HSE oscillator is euqipped
     * @retval None
     *************************************************************************/
    static void SystemClock_HSE_xxMHz_Vrange_Auto( bool bSwitchOffHSI )
    {
      RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
      RCC_OscInitTypeDef osc = {0};

      ConfigureHSE(&osc);

      SetPredividers( &RCC_ClkInitStruct, HW_HSE_FREQUENCY/1000 );
      RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;

      /* 
       * At this "low" frequencies AHB clock frq = sysclk, so we can safely use sysclk 
       * as flash clock parameter for GetFlashLatency()
       */
      uint32_t flash_latency= GetFlashLatency(PWR_REGULATOR_VOLTAGE_SCALE3, HW_HSE_FREQUENCY/1000);
      uint32_t prg_delay    = GetFlashPrgDelay(HW_HSE_FREQUENCY/1000);

      DoClockTransition(HW_HSE_FREQUENCY/1000, &osc, &RCC_ClkInitStruct, flash_latency, prg_delay, PWR_REGULATOR_VOLTAGE_SCALE3, -5);

      /* Disable HSI Oscillator, if desired */
      if ( bSwitchOffHSI ) {
        SwitchOffHSI(&osc);
        /* CSI as Wakeup clock */
        SET_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
      } else {
        /* HSI as Wakeup clock */
        CLEAR_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
      }

      /* Switch off PLL in any case */
      SwitchOffSysClkPll();

      /* LSE has to be restored after stop */
      bClockSettingVolatile = true;         
      saved_khz             = HW_HSE_FREQUENCY/1000;
      saved_latency         = flash_latency;
      saved_vosrange        = 3;
      RestoreFn             = SystemClock_HSE_xxMHz_Vrange_Auto_restore;
    }

    static void SwitchOffHSE(void)
    {
        RCC_OscInitTypeDef RCC_OscInitStruct = {0};

        RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
        RCC_OscInitStruct.HSIState = RCC_HSE_OFF;
        if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
        {
          Error_Handler_XX(-5, __FILE__, __LINE__ );
        }
    }
#endif




/*
 * The initialization part that has to be restored after wakeup from stop 
 */
static void SystemClock_PLL_xxMHz_Vrange_01_restore (uint32_t xxkhz, bool bSwitchOffHSI)
{
  UNUSED(xxkhz);
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};

  /* Restart PLL1 after Stop */
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
     Error_Handler_XX(-12, __FILE__, __LINE__); 

  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  if ( HAL_RCC_ClockConfig(&RCC_ClkInitStruct, saved_latency ) != HAL_OK )
     Error_Handler_XX(-12, __FILE__, __LINE__); 

  if ( bSwitchOffHSI ) {
    SwitchOffHSI(&RCC_OscInitStruct);
  }
}

/**
  * @brief  System Clock Configuration on 64-480 PLL-Clock, basing on 16MhZ HSI or 8MHz HSE
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL Clock
  *            PLL input                      = 16MHz HSI RC-oscillator
  *            SYSCLK(Hz)                     = as desired, between 64 and 480 MHz ( maximum specified )
  *            HCLK(Hz)                       = as desired, between 32 and 240 MHz ( maximum specified )
  *            AHB Prescaler                  = so, that resulting AHB frq is at or below 240MHz
  *            APBx Prescaler                 = so, that resulting APB frq is at or below 120MHz
  *            Flash Latency(WS)              = depending from xxmhz, between 0 and 4
  *            Main regulator output voltage  = depending from xxmhz, between VOSRANGE_0 and _3
  *
  * 
  * @param  bUseHSE, true when HSE is used as PLL input, false for HSI input
  * @param  bSwitchOffOther true, if other HSx source is to be switched off
  *         Notice: User has to take care to possibly switch on HSx again before going to sleep
  * @note   Algorithm only works for desired SYSCLK frq between 64 and 480 MHz!
  */
static void SystemClock_PLL_xxxMHz_Vrange_Auto(uint32_t pll_khz, bool bUseHSE, bool bSwitchOffOther)
{
  #define PLL_HSI_BASE_FRQ_KHZ      16000
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  uint32_t pll_inp_khz;
  bool bBaseClkSet = false;         /* flag for "PLL base clock has been set"   */

  /* 
   * Check constraints 
   * The lower limit of 50 MHz has no physical reason, just inserted by me
   */
  if ( pll_khz > MAX_CLK_CPU || pll_khz < 50000) {
    Error_Handler_XX(-9, __FILE__, __LINE__);
  }

