rainer20512/stm32-fw/stm32h7/common_h7/Src/system/clockconfig.c
  /* 
   * if PLL is currently in use, it has to be deactivated before changes may be applied
   * so select PLL input clock as SYSCLK temporarily. No constraint violation to VOS range 
   * or flash latency, because PLL inp clock is always lower or equal to previous PLL output frq
   */
  if ( __HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_PLL1 ) {
     if ( bUseHSE ) {
        #if defined(HW_HAS_HSE)
            ConfigureHSE(&RCC_OscInitStruct);
            pll_inp_khz = HW_HSE_FREQUENCY/1000;
            RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
        #else
            Error_Handler_XX(-5, __FILE__, __LINE__);       
        #endif
     } else { 
        ConfigureHSI(&RCC_OscInitStruct, PLL_HSI_BASE_FRQ_KHZ);
        pll_inp_khz = PLL_HSI_BASE_FRQ_KHZ;
        RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
     }

     if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK) Error_Handler_XX(-6, __FILE__, __LINE__); 

     /* Set all clocks and predividers according to that intermediate low and safe frequewncy */
     SetPredividers(&RCC_ClkInitStruct, pll_inp_khz);
     if ( HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK ) Error_Handler_XX(-6, __FILE__, __LINE__); 
     
     /* Stop PLL */
    PLL_Stop(SYSCLK_PLL);

     /* clear Osc and Clk init structures after use */
     memset(&RCC_OscInitStruct,0, sizeof(RCC_OscInitTypeDef));
     memset(&RCC_ClkInitStruct,0, sizeof(RCC_ClkInitTypeDef));
     /* PLL base clock is set already to final values */
     bBaseClkSet = true;
  }

  uint32_t ahb_clock_khz = SetPredividers( &RCC_ClkInitStruct, pll_khz );

  /* Set VOS range to 0 when ahb clock > 225 MHz */
  /* Since nucleo board has SMPS only support, VOS scale 0 is inibited */
  /* For lower frequencies, select scale 2, scake 1 only for high requencies */
  #if defined(STM32H745xx) || defined(STM32H747xx)
      /* Set VOS range to 0 when ahb clock > 225 MHz */
      /* Since nucleo board has SMPS only support, VOS scale 0 is inibited */
      /* For lower frequencies, select scale 2, scake 1 only for high requencies */
      uint32_t vosrange = ( ahb_clock_khz > 225000 ? PWR_REGULATOR_VOLTAGE_SCALE1 : PWR_REGULATOR_VOLTAGE_SCALE2 );
  #elif defined(STM32H742xx) || defined(STM32H743xx)
      /* Set VOS range to 0 when ahb clock > 225 MHz */
      /* Since nucleo board has SMPS only support, VOS scale 0 is inibited */
      /* For lower frequencies, select scale 2, scale 1 only for high requencies */
      uint32_t vosrange = ( ahb_clock_khz > 225000 ? PWR_REGULATOR_VOLTAGE_SCALE0 :  ahb_clock_khz > 140000 ? PWR_REGULATOR_VOLTAGE_SCALE1 : PWR_REGULATOR_VOLTAGE_SCALE2 );
  #elif defined(STM32H723xx) || defined(STM32H733xx) || defined(STM32H725xx) || defined(STM32H735xx) || defined(STM32H730xx)
      /* See Chapter 6.3.1  "General Operating Conditions", Table 13 for AHB/AXI clock limits for certain VOS values */
      uint32_t vosrange = ( ahb_clock_khz > 200000 ? PWR_REGULATOR_VOLTAGE_SCALE0 :  ahb_clock_khz > 150000 ? PWR_REGULATOR_VOLTAGE_SCALE1 : ahb_clock_khz > 85000 ? PWR_REGULATOR_VOLTAGE_SCALE2 : PWR_REGULATOR_VOLTAGE_SCALE3 );
  #else
      #error "No VOS range determination defined"
  #endif
  /* calculate neccessary minimum flash latency */
  uint32_t flash_latency = GetFlashLatency(vosrange, ahb_clock_khz);
  uint32_t prg_delay     = GetFlashPrgDelay(ahb_clock_khz);

  /* configure PLL input clock */
  if ( bUseHSE ) {
    #if defined(HW_HAS_HSE)
        /* Don't set base clock again, if already set */
        if (!bBaseClkSet) ConfigureHSE(&RCC_OscInitStruct);
        RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
        pll_inp_khz = HW_HSE_FREQUENCY / 1000;
    #else
        Error_Handler_XX(-5, __FILE__, __LINE__);       
    #endif    
  } else {
        /* Don't set base clock again, if already set */
        if (!bBaseClkSet) ConfigureHSI(&RCC_OscInitStruct, PLL_HSI_BASE_FRQ_KHZ);
        RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
        pll_inp_khz = PLL_HSI_BASE_FRQ_KHZ;
  }

  if ( PLL_Configure_SYSCLK(&RCC_OscInitStruct, pll_khz, pll_inp_khz) != PLL_CONFIG_OK ) Error_Handler_XX(-6, __FILE__, __LINE__); 

  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  
  DoClockTransition(pll_khz,&RCC_OscInitStruct, &RCC_ClkInitStruct, flash_latency, prg_delay, vosrange, -4);


  /* Disable MSI Oscillator, if desired */
  if ( bSwitchOffOther ) {
    if ( bUseHSE ) {
        SwitchOffHSI(&RCC_OscInitStruct);
        /* CSI as Wakeup clock */
        SET_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
    } else {
        #if defined(HW_HAS_HSE)
            SwitchOffHSE();
        #endif
    }
  }

  /* Select HSI also as WakeUp clock */
  SET_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);

  bClockSettingVolatile = true;         
  saved_khz             = pll_khz;
  saved_latency         = flash_latency;
  saved_vosrange        = vosrange;
  RestoreFn             = SystemClock_PLL_xxMHz_Vrange_01_restore;
}

/* Only use "SystemClock_SetConfiguredClock" to change system clock            */
/* THis will ensure, that all devices will be noticed about clock              */
/* changes                                                                     */
/*******************************************************************************
 * Do all the clock setting on a configuration byte basis
 *******************************************************************************/
void SystemClock_Set(CLK_CONFIG_T clk_config_byte, bool bSwitchOffMSI )
{
    /* Save desired settings for restoration after Stop */
    saved_bSwitchOffMSI   = bSwitchOffMSI;

    /* 
     * Initially assunm, that there is no restoration needed
     * In general, all clock settings on basis of HSI are non volatile
     * and do not need a restoration, whereas all other clock settings 
     * ( eg. HSE or PLL are volatile and need a restauration 
     */
    bClockSettingVolatile = false;         
    RestoreFn             = NULL;

    /* Inform about outstanding frq change */
    DevicesBeforeFrqChange();

    switch ( clk_config_byte ) {
        case  CLK_HSI_08MHZ:
            SystemClock_HSI_VOSrange_3(8000);
            break;
        case  CLK_HSI_16MHZ:
            SystemClock_HSI_VOSrange_3(16000);
            break;
        case  CLK_HSI_32MHZ:
            SystemClock_HSI_VOSrange_3(32000);
            break;
        case  CLK_HSI_64MHZ:
            SystemClock_HSI_VOSrange_3(64000);
            break;
/*------------------------------------------------------------------------------*/ 
/* Note: Do not use PLL with HSI as input at higher frequencies, this will lead */
/*       to unpredictable results / hanging system                              */
/*------------------------------------------------------------------------------*/ 
        case CLK_PLL_50MHZ:
           SystemClock_PLL_xxxMHz_Vrange_Auto(50000, true, false);
            break;
        case  CLK_PLL_100MHZ:
            SystemClock_PLL_xxxMHz_Vrange_Auto(100000, true, false);
            break;
        case  CLK_PLL_200MHZ:
            SystemClock_PLL_xxxMHz_Vrange_Auto(200000, true, false);
            break;
        case  CLK_PLL_300MHZ:
            SystemClock_PLL_xxxMHz_Vrange_Auto(300000, true, false);
            break;
        case  CLK_PLL_400MHZ:
            SystemClock_PLL_xxxMHz_Vrange_Auto(400000, true, false);
            break;
        case  CLK_PLL_480MHZ:
            SystemClock_PLL_xxxMHz_Vrange_Auto(480000, true, false);
            break;
#if  defined(STM32H723xx) || defined(STM32H733xx) || defined(STM32H725xx) || defined(STM32H735xx) || defined(STM32H730xx)
        case  CLK_PLL_500MHZ:
            SystemClock_PLL_xxxMHz_Vrange_Auto(500000, true, false);
            break;
        case  CLK_PLL_550MHZ:
            SystemClock_PLL_xxxMHz_Vrange_Auto(550000, true, false);
            break;
#endif


#if defined(HW_HAS_HSE)
        case  CLK_HSE_xxMHZ:
            SystemClock_HSE_xxMHz_Vrange_Auto(false);
#endif
    } // Case

