rainer20512/stm32-fw/stm32h7/common_h7/Src/system/clockconfig.c
    /* Update the system clock variables */
    SystemCoreClockUpdate();

    /* Notice all devices about frequency change                             */
    /* Momentarily, the frq change is not reverted, if any device refuses to */
    /* change frq. this has to be changed for correct implementation         */
    /* Eg by asking before frq change takes place                            */
    if ( DevicesInhibitFrqChange() ) {
        #if DEBUG_MODE > 0
            DEBUG_PUTS("ERR: One or more devices did not agree to new frequency!");
        #endif
    }

    /* Notify all registered callbacks **** C001 **** */
    ClockNotifyCallbacks(HAL_RCC_GetSysClockFreq());

    #if DEBUG_MODE > 0
        uint32_t sys_real = HAL_RCC_GetSysClockFreq();
        DEBUG_PRINTF("SYSCLK nom. %d.%06dMHz\n",sys_real/1000000,sys_real%1000000 );
        uint32_t sysclk = Get_SysClockFrequency();
        DEBUG_PRINTF("SYSCLK real %d.%06dMHz\n",sysclk/1000000,sysclk%1000000);
    #endif

}

/******************************************************************************
 * Set the system clock configuration as configured in config-variable
 *****************************************************************************/
void SystemClock_SetConfiguredClock(void)
{
  // Set clcock configuration, switch MSI off, if no more used
  SystemClock_Set(config.clk_config, true );
}

/* LSE --- LSE --- LSE --- LSE --- LSE --- LSE --- LSE --- LSE --- LSE --- LS*/
 /*****************************************************************************
  * @brief  Configure LSE
  * @param  bLSEon - switch LSE on or off
  * @param  bUseAsRTCClock - configure RTC to use LSE as clocksource
  ****************************************************************************/
void LSEClockConfig(bool bLSEon, bool bUseAsRTCClock)
{
  RCC_OscInitTypeDef        RCC_OscInitStruct;
  RCC_PeriphCLKInitTypeDef  PeriphClkInitStruct;
  
  /*Switch LSE on or OFF */
  RCC_OscInitStruct.OscillatorType =  RCC_OSCILLATORTYPE_LSE;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.LSEState = bLSEon ? RCC_LSE_ON : RCC_LSE_OFF;

  if ( bLSEon ) __HAL_RCC_LSEDRIVE_CONFIG(RCC_LSEDRIVE_LOW);
 

  if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
      Error_Handler_XX(-11, __FILE__, __LINE__);
      
 
  /* Set LSE as RTC clock source, if desired */
  if ( bUseAsRTCClock )  {
      PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RTC;
      PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSE;
      if(HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
          Error_Handler_XX(-11, __FILE__, __LINE__);
          
  }

}

/* LSI --- LSI --- LSI --- LSI --- LSI --- LSI --- LSI --- LSI --- LSI --- LS*/
 /*****************************************************************************
  * @brief  Configure LSI
  * @param  bLSIon - switch LSI on or off
  * @param  bUseAsRTCClock - configure RTC to use LSI as clocksource
  ****************************************************************************/
void LSIClockConfig(bool bLSIon, bool bUseAsRTCClock)
{
  RCC_OscInitTypeDef        RCC_OscInitStruct;
  RCC_PeriphCLKInitTypeDef  PeriphClkInitStruct;
  
  /*Switch LSI on or OFF */
  RCC_OscInitStruct.OscillatorType =  RCC_OSCILLATORTYPE_LSI;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.LSIState = bLSIon ? RCC_LSI_ON : RCC_LSI_OFF;

  if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
      Error_Handler_XX(-11, __FILE__, __LINE__);
      
 
  /* Set LSI as RTC clock source, if desired */
  if ( bUseAsRTCClock )  {
      PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RTC;
      PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
      if(HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
          Error_Handler_XX(-11, __FILE__, __LINE__);
          
  }

}

void SetPeripheralClkSource( uint32_t src )
{
    if ( src < 3 ) {
        MODIFY_REG(RCC->D1CCIPR, RCC_D1CCIPR_CKPERSEL_Msk, src << RCC_D1CCIPR_CKPERSEL_Pos);
    } else {
        DEBUG_PUTS("Error: SetPeripheralClkSource -illegal source");
    }
}


void HSIClockConfig(bool bHSIon)
{
  RCC_OscInitTypeDef        RCC_OscInitStruct;
  
  /*Switch HSI on or OFF */
  RCC_OscInitStruct.OscillatorType =  RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;            /* Reset value */
  RCC_OscInitStruct.HSIState = bHSIon ? RCC_HSI_ON : RCC_HSI_OFF;
  if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
      Error_Handler(__FILE__, __LINE__);
  
}

/******************************************************************************
 * the following two functions are added due to **** C001 ****
 *****************************************************************************/
/******************************************************************************
 * @brief Register a clock change callback
 * @param changeCB callback function to be notified on clock changes
 * @returns 0  on success
 *          -1 ERR_: no more room to register callback
 *          -2 error: callback must no be NULL
 * @note Once registered a function, it can never be unregistered again
 *****************************************************************************/
int32_t ClockRegisterForClockChange ( ClockChangeCB changeCB )
{
    /* Space left in array ? */
    if ( numClkchangeCB >= MAX_CLKCHG_CB - 1 ) return -1;

    /* CB must not be NULL */
    if ( changeCB == 0 ) return -2;

    clkCB[numClkchangeCB++] = changeCB;
    return 0;
}

/******************************************************************************
 * @brief Notify all registered callbacks on Clock change
 * @param newclk  new clock frequncy in Hz
 *****************************************************************************/
void   ClockNotifyCallbacks(uint32_t newclk)
{
    for ( int32_t i = 0; i < numClkchangeCB; i++ ) 
        clkCB[i](newclk);
}



/******************************************************************************
 * Do a Calibration of the HSI clock 
 * To do this, the LSE clock has to be on. SYSCLK will be switched to
 * HSI temporarily
 * TMR15 is used to perform the calibration
 *****************************************************************************/

#include "debug_helper.h"

#define __TIMx_CLK_ENABLE()        __HAL_RCC_TIM15_CLK_ENABLE()
#define __TIMx_CLK_DISABLE()       __HAL_RCC_TIM15_CLK_DISABLE()
#define  TIMx                       TIM15
#define  TIM_CHANNEL_y              TIM_CHANNEL_1
#define  HAL_TIM_ACTIVE_CHANNEL_y   HAL_TIM_ACTIVE_CHANNEL_1
#define  TIM_TIMx_GPIO              TIM_TIM15_TI1_GPIO
#define  TIM_TIMx_LSE               TIM_TIM15_TI1_RCC_LSE
#define  TIMx_IRQn                  TIM15_IRQn

#define CAPTURE_START              ((uint32_t) 0x00000001)
#define CAPTURE_ONGOING            ((uint32_t) 0x00000002)
#define CAPTURE_COMPLETED          ((uint32_t) 0x00000003)

/* No timer input prescaler */
#define HSI_TIMx_COUNTER_PRESCALER   ((uint32_t)0)
/* The signal in input capture is divided by 8 */
#define HSI_TIMx_IC_DIVIDER          TIM_ICPSC_DIV8

/* The LSE is divided by 8 => LSE/8 = 32768/8 = 4096 */
#define REFERENCE_FREQUENCY         ((uint32_t)4096) /*!< The reference frequency value in Hz */

/* Timeout to avoid endless loop */
#define HSI_TIMEOUT                    ((uint32_t)0xFFFFFF)

/* Number of measurements in the loop */
#define HSI_NUMBER_OF_LOOPS            ((uint32_t)10)

#define INITIAL_ERROR              ((uint32_t)99999000)

TIM_HandleTypeDef  TimHandle; /* Timer handler declaration */
uint32_t __IO       CaptureState;
uint32_t __IO       Capture;
uint32_t            StartCalibration;
uint32_t            IC1ReadValue1 = 0, IC1ReadValue2 = 0;
/* Exported macro ------------------------------------------------------------*/
#define __HAL_GET_TIM_PRESCALER(__HANDLE__)       ((__HANDLE__)->Instance->PSC)
#define ABS_RETURN(x)                             (((x) < 0) ? -(x) : (x))
#define __HAL_GET_HSI_CALIBRATIONVALUE() \
                  ((RCC->HSICFGR & RCC_HSICFGR_HSITRIM_Msk) >> RCC_HSICFGR_HSITRIM_Pos)

