rainer20512/stm32-fw/stm32h7/common_h7/Src/system/clockconfig.c
  while ((RCC->CR & RCC_CR_HSI48RDY) == 0);

  #define CRS_CFGR_SYNCSRC_USB2SOF        0b00
  #define CRS_CFGR_SYNCSRC_LSE            (0b01 << CRS_CFGR_SYNCSRC_Pos)
  #define CRS_CFGR_SYNCSRC_OTGHS1SOF      (0b10 << CRS_CFGR_SYNCSRC_Pos)

  __HAL_RCC_CRS_CLK_ENABLE();

  /* Set RELOAD and FELIM value according to Refman 9.5.4 */
  /* Ftarget = 48 MHz, Fsync = 32768Hz */
  #define QUOTIENT ((48000000+16384)/32788)
  #define RELOAD_VAL (QUOTIENT - 1)
  /* Trimming step size is 0,14% */
  #define FELIM_VAL  (QUOTIENT*140 + 10000 ) / 20000

  /* Enable synchronization with LSE */
  regval = READ_REG(CRS->CFGR); 
  MODIFY_REG(regval, CRS_CFGR_SYNCSRC_Msk,  CRS_CFGR_SYNCSRC_LSE);
  MODIFY_REG(regval, CRS_CFGR_RELOAD_Msk,  RELOAD_VAL << CRS_CFGR_RELOAD_Pos );
  MODIFY_REG(regval, CRS_CFGR_FELIM_Msk,   FELIM_VAL << CRS_CFGR_FELIM_Pos );
  WRITE_REG(CRS->CFGR, regval);

  /* Set the AUTOTRIMEN bit the CRS_CR register to enables the automatic
   * hardware adjustment of TRIM bits according to the measured frequency
   * error between the selected SYNC event. Also enable CEN bit to enable
   * frequency error counter and SYNC events.
   */

  SET_BIT(CRS->CR, CRS_CR_AUTOTRIMEN | CRS_CR_CEN );  
}

/****************************************************************************
 * Name: stm32l4_disable_hsi48
 *
 * Description:
 *   Disable the HSI48 clock.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void stm32h7_disable_hsi48(void)
{

  /* Disable the HSI48 clock and autotrim */
  CLEAR_BIT(CRS->CR, CRS_CR_AUTOTRIMEN | CRS_CR_CEN );  
  __HAL_RCC_CRS_CLK_DISABLE();
  CLEAR_BIT(RCC->CR, RCC_CR_HSI48ON);

}

#endif

/**
  * @}
  */


